In [1]:
import pandas as pd ; import numpy as np

In [5]:
dtf=pd.read_table("veri.txt")
dtf

    isim  puan cinsiyet
0  Caner    70        E
1    Ali    80        E
2   Ayşe    90        K
3  Fatma   100        K
4   Veli    45        E

In [6]:
dt=pd.read_table("veri3.txt",sep=",", index_col=["ders","isim"])
dt

            bir  iki
ders isim
Fiz  Ali     30   46
     Caner   12   28
     Veli    45   36
Mat  Ali     50   55
     Caner   24   16
     Veli    60   70

In [7]:
dtfrm=pd.read_table("veri4.txt",sep=",",skiprows=[0,2], usecols=[0,1])
dtfrm

    isim  puan
0    Ali    80
1  Caner    26
2   Elif    94
3   Ayşe   100

In [8]:
dt2=pd.read_table("veri5.txt",sep=",")
dt2

    isim  puan cinsiyet
0    Ali    80        E
1  Caner    26      n.a
2    NaN    94        K
3   Ayşe   100      NaN
4  Fatma    -8        K

In [9]:
pd.isnull(dt2)

    isim   puan  cinsiyet
0  False  False     False
1  False  False     False
2   True  False     False
3  False  False      True
4  False  False     False

In [10]:
dt2=pd.read_table("veri5.txt",sep=",",na_values=["n.a",-8])

In [11]:
dt2

    isim   puan cinsiyet
0    Ali   80.0        E
1  Caner   26.0      NaN
2    NaN   94.0        K
3   Ayşe  100.0      NaN
4  Fatma    NaN        K

In [12]:
df=pd.read_table("veri.txt")
df

    isim  puan cinsiyet
0  Caner    70        E
1    Ali    80        E
2   Ayşe    90        K
3  Fatma   100        K
4   Veli    45        E

In [19]:
import sys

In [20]:
df.to_csv(sys.stdout,sep="|")

|isim|puan|cinsiyet
0|Caner|70|E
1|Ali|80|E
2|Ayşe|90|K
3|Fatma|100|K
4|Veli|45|E

In [21]:
df.to_csv(sys.stdout,sep="|",na_rep="NULL",index=False, header=False)

Caner|70|E
Ali|80|E
Ayşe|90|K
Fatma|100|K
Veli|45|E